<a href="https://colab.research.google.com/github/saidabroor/Database_class/blob/main/DBWEEK9LAB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [19]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db/")
print(my_conn.name)

sqlite

In [20]:
r_set=my_conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in r_set:
  print(row)

('category',)
('subcategory',)
('student',)

In [21]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(12, 'Recky', 'Six', 94, 'female')
(13, 'Kty', 'Seven', 88, 'female')
(14, 'Bigy', 'Seven', 88, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(17, 'Tumyu', 'Six', 54, 'male')
(18, 'Honny', 'Five', 75, 'male')
(19, 'Tinny', 'Nine', 18, 'male')
(20, 'Jackly', 'Nine', 65, 'female')
(21, 'Babby John', 'Four', 69, 'female')
(22, 'Reggid', 'Seven', 55, 'female')
(23, 'Herod', 'Eight', 79, 'male')
(24, 'Tiddy Now', 'Seven', 78, 'male')
(25, 'Giff Tow', 'Seven', 88, 'male')
(26, 'Crelea', 'Seven', 79, 'male')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [22]:
r_set=my_conn.execute('''SELECT * FROM category''');
for row in r_set:
  print(row)

(1, 'Fruits')
(2, 'Colors')
(3, 'Games')
(4, 'Vehicles')

In [18]:
r_set=my_conn.execute('''SELECT * FROM subcategory''');
for row in r_set:
  print(row)

(1, 'Mango')
(1, 'Banana')
(1, 'Orange')
(1, 'Apple')
(2, 'Red')
(2, 'Blue')
(2, 'Green')
(2, 'Yellow')
(3, 'Cricket')
(3, 'Football')
(3, 'Baseball')
(3, 'Tennis')
(4, 'Cars')
(4, 'Trucks')
(4, 'Bikes')
(4, 'Train')

In [16]:
# display all records of particular class only
q="SELECT id, name, class, mark, sex FROM student WHERE class='Four'"
my_cursor=my_conn.execute(q)
for row in my_cursor:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(10, 'Big John', 'Four', 55, 'female')
(15, 'Tade Row', 'Four', 88, 'male')
(16, 'Gimmy', 'Four', 88, 'male')
(21, 'Babby John', 'Four', 69, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')

In [17]:
my_cursor = my_conn.execute("select id, name, class, mark, sex from student where id = 8")
data_row = my_cursor.fetchone()

print(data_row)

(8, 'Asruid', 'Five', 85, 'male')

In [24]:
# select 10 records only
q="SELECT id, name, class, mark, sex FROM student limit 0,10"
my_cursor=my_conn.execute(q)
data_row=my_cursor.fetchall()
print(type(data_row))
print("No of records : {}".format(len(data_row)))
for row in data_row:
  print(row)

<class 'list'>
No of records : 10
(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')

In [25]:
# delete sample table student
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''DROP table student;''')
  print("student table deleted")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)
  #print(e)

student table deleted

In [26]:
# creating student table
from sqlalchemy.exc import SQLAlchemyError
try:
  my_conn.execute('''
    CREATE TABLE IF NOT EXISTS student(id integer primary key,
                                       name text,
                                       class text,
                                       mark integer,
                                       sex text
                                       );''')
  
  print("Student Table created successfully")
except SQLAlchemyError as e:
  error = str(e._dict_['orig'])
  print(error)

Student Table created successfully

In [27]:
# add records to student table
r_set=my_conn.execute('''INSERT INTO `student`
(`id`,`name`,`class`,`mark`,`sex`) VALUES
(1, 'John Deo', 'Four', 75, 'female'),
(2, 'Max Ruin', 'Three', 85, 'male'),
(3, 'Arnold', 'Three', 55, 'male'),
(4, 'Krish Star', 'Four', 60, 'female'),
(5, 'John Mike', 'Four', 60, 'female'),
(6, 'Alex John', 'Four', 55, 'male'),
(7, 'My John Rob', 'Five', 78, 'male'),
(8, 'Asruid', 'Five', 85, 'male'),
(9, 'Tes Qry', 'Six', 78, 'male'),
(10, 'Big John', 'Four', 55, 'female'),
(11, 'Ronald', 'Six', 89, 'female'),
(27, 'Big Nose', 'Three', 81, 'female'),
(28, 'Rojj Base', 'Seven', 86, 'female'),
(29, 'Tess Played', 'Seven', 55, 'male'),
(30, 'Reppy Red', 'Six', 79, 'female'),
(31, 'Marry Toeey', 'Four', 88, 'male'),
(32, 'Binn Rott', 'Seven', 90, 'female'),
(33, 'Kenn Rein', 'Six', 96, 'female'),
(34, 'Gain Toe', 'Seven', 69, 'male'),
(35, 'Rows Noump', 'Six', 88, 'female');''')

In [28]:
my_conn = create_engine("sqlite:///my_db2.db")
conn = my_conn.connect()

!ls

my_db2.db  my_db.db  sample_data  student_insert.sql  student_tables.sql

In [12]:
from sqlalchemy import create_engine
my_conn = create_engine("sqlite:////content/my_db.db/")

# Show the list of tables
r_set = my_conn.execute('''select name from sqlite_master where type = 'table' ''')
for row in r_set:
    print(row)

('category',)
('subcategory',)
('student',)

In [29]:
# Open file and run script
with open("student_tables.sql", "r") as file:
    query = file.read()
    my_conn.execute(query)

# Show the list of tables
r_set = my_conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
for row in r_set:
    print(row)

('student',)

In [30]:
with open("student_insert.sql", "r") as file:
    query = file.read()
    my_conn.execute(query)

r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

In [31]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark=mark+1"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  20

In [32]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 76, 'female')
(2, 'Max Ruin', 'Three', 86, 'male')
(3, 'Arnold', 'Three', 56, 'male')
(4, 'Krish Star', 'Four', 61, 'female')
(5, 'John Mike', 'Four', 61, 'female')
(6, 'Alex John', 'Four', 56, 'male')
(7, 'My John Rob', 'Five', 79, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 56, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Three', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 89, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [33]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark=mark+1 WHERE id=7"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  1

In [34]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 76, 'female')
(2, 'Max Ruin', 'Three', 86, 'male')
(3, 'Arnold', 'Three', 56, 'male')
(4, 'Krish Star', 'Four', 61, 'female')
(5, 'John Mike', 'Four', 61, 'female')
(6, 'Alex John', 'Four', 56, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 56, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Three', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 89, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [35]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET mark=mark+1 WHERE class='Four'"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  6

In [36]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 77, 'female')
(2, 'Max Ruin', 'Three', 86, 'male')
(3, 'Arnold', 'Three', 56, 'male')
(4, 'Krish Star', 'Four', 62, 'female')
(5, 'John Mike', 'Four', 62, 'female')
(6, 'Alex John', 'Four', 57, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 57, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Three', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 90, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [37]:
from sqlalchemy.exc import SQLAlchemyError
q="UPDATE student SET class='Four' WHERE class='Three'"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  3

In [38]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 77, 'female')
(2, 'Max Ruin', 'Four', 86, 'male')
(3, 'Arnold', 'Four', 56, 'male')
(4, 'Krish Star', 'Four', 62, 'female')
(5, 'John Mike', 'Four', 62, 'female')
(6, 'Alex John', 'Four', 57, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 57, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Four', 82, 'female')
(28, 'Rojj Base', 'Seven', 87, 'female')
(29, 'Tess Played', 'Seven', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 90, 'male')
(32, 'Binn Rott', 'Seven', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Seven', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [39]:
from sqlalchemy.exc import SQLAlchemyError
id=input("Enter student id : ")
my_data=(id,)
q="UPDATE student SET mark=mark+5 WHERE id=?"
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

Enter student id : 4
No of records updated :  1

In [40]:
from sqlalchemy.exc import SQLAlchemyError
my_data=('Six','Seven')
q="UPDATE student SET class=? WHERE class=?"
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records updated : ",r_set.rowcount)

No of records updated :  4

In [41]:
r_set=my_conn.execute('''SELECT * FROM student''');
for row in r_set:
  print(row)

(1, 'John Deo', 'Four', 77, 'female')
(2, 'Max Ruin', 'Four', 86, 'male')
(3, 'Arnold', 'Four', 56, 'male')
(4, 'Krish Star', 'Four', 67, 'female')
(5, 'John Mike', 'Four', 62, 'female')
(6, 'Alex John', 'Four', 57, 'male')
(7, 'My John Rob', 'Five', 80, 'male')
(8, 'Asruid', 'Five', 86, 'male')
(9, 'Tes Qry', 'Six', 79, 'male')
(10, 'Big John', 'Four', 57, 'female')
(11, 'Ronald', 'Six', 90, 'female')
(27, 'Big Nose', 'Four', 82, 'female')
(28, 'Rojj Base', 'Six', 87, 'female')
(29, 'Tess Played', 'Six', 56, 'male')
(30, 'Reppy Red', 'Six', 80, 'female')
(31, 'Marry Toeey', 'Four', 90, 'male')
(32, 'Binn Rott', 'Six', 91, 'female')
(33, 'Kenn Rein', 'Six', 97, 'female')
(34, 'Gain Toe', 'Six', 70, 'male')
(35, 'Rows Noump', 'Six', 89, 'female')

In [42]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class)  FROM student"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Four
Five
Six
No of records displayed :  3

In [43]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class)  FROM student WHERE mark>=80"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Four
Five
Six
No of records displayed :  3

In [44]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT(class)  FROM student order by class"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Five
Four
Six
No of records displayed :  3

In [45]:
from sqlalchemy.exc import SQLAlchemyError
q="SELECT DISTINCT class,sex  FROM student order by class"
try:
  r_set=my_conn.execute(q)
  data=r_set.fetchall()
  for row in data:
    print(row[0],row[1])
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records displayed : ",len(data))

Five male
Four female
Four male
Six male
Six female
No of records displayed :  5

In [46]:
from sqlalchemy.exc import SQLAlchemyError
q="DELETE FROM student WHERE id=5"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

No of records deleted :  1

In [47]:
from sqlalchemy.exc import SQLAlchemyError
q="DELETE FROM student WHERE class='Four'"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

No of records deleted :  8

In [48]:
from sqlalchemy.exc import SQLAlchemyError
my_data=("Five",)
q="DELETE FROM student WHERE class=?"
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

No of records deleted :  2

In [49]:
from sqlalchemy.exc import SQLAlchemyError
my_data=("Six","Seven")
q="DELETE FROM student WHERE class=? OR class=? "
try:
  r_set=my_conn.execute(q,my_data)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

No of records deleted :  9

In [50]:
from sqlalchemy.exc import SQLAlchemyError
q="DELETE FROM student"
try:
  r_set=my_conn.execute(q)
except SQLAlchemyError as e:
  error=str(e.__dict__['orig'])
  print(error)
else:
  print("No of records deleted : ",r_set.rowcount)

No of records deleted :  0